{
  "main": {
    "role": {
      "type": "one-roll string table",
      "interface": "!1d100",
      "values": [
        "Agronomist",
        "Ambassador",
        "Anthropologist",
        "Archaeologist",
        "Artificer",
        "Assassin",
        "Banker",
        "Barbarian Noble",
        "Bodysnatcher",
        "Botanist",
        "Broken Wanderer",
        "Cartographer",
        "Chief",
        "Con Artist",
        "Courtesan",
        "Cultist",
        "Cursed Hero",
        "Cursed Wanderer",
        "Dentist",
        "Dilettante",
        "Doctor",
        "Druggist",
        "Elder Parasite",
        "Emissary",
        "Engineer",
        "Entertainer",
        "Escaped Slave",
        "Eunuch",
        "Exile",
        "Explorer",
        "Fallen Hero",
        "Folk Hero",
        "Fugitive",
        "Genteel Adventurer",
        "Golem Operator",
        "Guild Representative",
        "Guildmaster",
        "Herder",
        "Heretic",
        "Historian",
        "Holy Warrior",
        "Hunter",
        "Ill Omen",
        "Inquisitor",
        "Inspector",
        "Investigator",
        "Machine Human",
        "Master Artisan",
        "Mechanic",
        "Mercenary",
        "Merchant",
        "Merchant Prince",
        "Messenger",
        "Miner",
        "Monster Hunter",
        "Musician",
        "Necromancer",
        "Noble",
        "Nomad",
        "Orphan",
        "Painter",
        "Patrol",
        "Peddler",
        "Pilgrim",
        "Plaguebearer",
        "Possessed",
        "Priest",
        "Prophet (mad)",
        "Prophet (real)",
        "Raider",
        "Reaver",
        "Refugee",
        "Researcher",
        "Scavenger",
        "Scientist",
        "Scoundrel",
        "Scout",
        "Sculptor",
        "Shaman",
        "Shepherd",
        "Slaver",
        "Soldier",
        "Sorcerer",
        "Spicer",
        "Spy",
        "Summoner",
        "Thief",
        "Thrill Seeker",
        "Time Traveller",
        "Tinker",
        "Ultra Voyager",
        "Undead Vessel",
        "Vile Spawn",
        "Vome Infiltrator",
        "Warlock",
        "Wine Vampire",
        "Witch",
        "Wizard",
        "Woodsman",
        "Zoologist"
      ]
    },
    "name": {
      "type": "combined string",
      "interface": "!1d100 !1d100",
      "values": [
        [
          "Almir",
          "Amaro",
          "Amberto",
          "Arcia",
          "Arnasto",
          "Astia",
          "Belina",
          "Benito",
          "Berengar",
          "Boko",
          "Cuoia",
          "Dalani",
          "Dana",
          "Davor",
          "Delno",
          "Depico",
          "Desena",
          "Dolce",
          "Enrike",
          "Erena",
          "Ernedar",
          "Estato",
          "Estrela",
          "Farfalon",
          "Fina",
          "Galavar",
          "Girolamo",
          "Girondo",
          "Goria",
          "Hotena",
          "Ipa",
          "Isizia",
          "Izabera",
          "Jalosti",
          "Jernina",
          "Jeuna",
          "Jion",
          "Karlo",
          "Karnelia",
          "Kasciuto",
          "Katyu",
          "Klesana",
          "Krasna",
          "Kujo",
          "Lateria",
          "Leonti",
          "Leuterio",
          "Leva",
          "Lisak",
          "Liuti",
          "Loma",
          "Maurizia",
          "Mehaci",
          "Mirena",
          "Mirodar",
          "Nebesa",
          "Noturna",
          "Ombra",
          "Opoya",
          "Paprizio",
          "Piskero",
          "Plania",
          "Prima",
          "Rasclana",
          "Rion",
          "Robais",
          "Rocio",
          "Rodina",
          "Rosa",
          "Rostolf",
          "Rumen",
          "Samorok",
          "Sangua",
          "Sarca",
          "Sciaca",
          "Scikapfo",
          "Scura",
          "Selesta",
          "Sentena",
          "Severa",
          "Sima",
          "Sinon",
          "Siya",
          "Sodoba",
          "Sulmar",
          "Tamke",
          "Teredo",
          "Tesana",
          "Tori",
          "Trista",
          "Urna",
          "Vedya",
          "Velena",
          "Vera",
          "Vero",
          "Volek",
          "Yako",
          "Yasna",
          "Yesen",
          "Yeza"
        ], 
        [
          "Al Piz",
          "Artifiziale",
          "Azul",
          "Bodizie",
          "Carnemante",
          "Celestini",
          "Circolangolo",
          "Cosmonauta",
          "d’Aranje",
          "da Pastafari",
          "Dabasso",
          "de Bianco",
          "de Carmico",
          "de Chouet",
          "de Giallo",
          "de Karavan",
          "de Nero",
          "de Safranj",
          "de Selezione",
          "de Serpens",
          "Decapolitan",
          "del Mar",
          "di Alto",
          "di Dormenta",
          "di Mesa",
          "di Verde",
          "Donaplenum",
          "Formatore",
          "Fustin",
          "Hexadni",
          "i’Buyeni",
          "i’Creati",
          "i’Fortun",
          "i’Grati",
          "i’Liberat",
          "i’Mertu",
          "i’Mutabili",
          "i’Novi",
          "i’Orca",
          "i’Profunt",
          "i’Sacer",
          "i’Syan",
          "i’Verdenti",
          "il’Arivat",
          "Malapensa",
          "Marmoresti",
          "Mecanizio",
          "Mentat",
          "Mercandili",
          "Metropolitan",
          "Moderni",
          "Nagori",
          "Nascosti",
          "Nauta",
          "Nebodari",
          "o’Sovobo",
          "od Cusciare",
          "od Jiab",
          "od Kaniona",
          "od Kujina",
          "od Mise",
          "od Notte",
          "od Petiz",
          "od Planye",
          "od Playe",
          "od Poti",
          "od Setroya",
          "od Sobe",
          "od Vina",
          "od Visocco",
          "od Vode",
          "od Vulkan",
          "od Yedeni",
          "Odlingi",
          "Ossomangio",
          "per Ambulati",
          "per Nascieni",
          "per Velizi",
          "po Viladrini",
          "Purpureo",
          "Raziunar",
          "ri Svelti",
          "Rinasciti",
          "Rudeni",
          "Rumeni",
          "s’Emerald",
          "Semolingi",
          "Seruleo",
          "Setvareni",
          "Tergestini",
          "Terracotan",
          "the Blue",
          "the Orange",
          "the Purple",
          "the Red",
          "the Yellow",
          "Travini",
          "Violo",
          "Vites",
          "za Zidovi"
        ]
      ]
    },
    "story": {
      "type": "one-roll string table",
      "interface": "!1d100",
      "values": [
        "Kind and knowledgeable. Has a secure traveling chest of horrors (L5, swarming).",
        "Wary, even terrified. Believes they are being pursued by demons (L4, chittering).",
        "Proud and pompous. Claims grand deeds, secretly inept.",
        "Magnificent drunkard. Drinks to avoid facing a cosmic secret.",
        "Lunatic. Literally, goes mad when they see the moon.",
        "World-weary and hopeless, goes on out of a dogged lack of imagination.",
        "Incredibly skilled but scatterbrained. Do not mention the war.",
        "Brittle, with a quiet desperation. Seeks a lost friend, but will fail.",
        "Bright and excited. Has found a secret machine in the wastes.",
        "Ashamed and glum. Dreams buried in dust centuries ago.",
        "High. Wants to dance with the flower people and to feel love all the time.",
        "Strong and stern. Emancipated from worldly cares, follows a higher doom.",
        "Melancholic. Heard a sound most cruel and knows a dark time comes.",
        "Two-faced. Will work hard to ingratiate themselves before stabbing in the back.",
        "Obsessed with the black slug (L7, mythical). Convinced its blood will be a panacea.",
        "Filthy but beatific. If dirt were holiness they would be a saint.",
        "Burns with anger. Righteous but misguided.",
        "Secret sinner under an angelic demeanor. A creature of the night.",
        "Cheery and bright. Terrifying when gripped by apocalyptic visions.",
        "A grimly nice person. Whiny and needful, though genuinely skilled.",
        "Gruff and bearish. On a very difficult and important quest.",
        "Boorish and offensive. Hides a heart of gold.",
        "Sad and distraught. Carries the burden of a great personal loss.",
        "Hopeless and bereft. Their past is buried in lies of a glorious future.",
        "Calm and cute. Eyes twinkle as they mock the daily grind.",
        "Jittery. Refuses to look up and fears the stars. Eyes, they call them.",
        "Creepy and quiet. Draws disturbing sigils when nobody is looking.",
        "Gentle and soft. Refuses to be drawn into any commitment or decision.",
        "Foolish. Uses charm and a ready grin to mask a deep well of uncertainty.",
        "Brutal and heartless. They lost their mother to a strange wandering poet.",
        "Waffling and harmless. Turns into a beast when exposed to the moon.",
        "Full of jokes. Terrified of all metals and murmurs of the machines that eat.",
        "Slimy and obsequious. A toad among humans, but not a cultist.",
        "Careless and thoughtless. Obsessed with flawed formulae.",
        "Nerdy and hurtful. Claims they are a victim of obscure misfortunes.",
        "Venom tongued but secretly kind. Hurt by circumstance.",
        "Ridiculously devout. Spouts verse to avoid facing harsh truths.",
        "Calculated and ecumenical. Deploys divinities to get their way.",
        "Weak but proud. Clutches to small victories with miserable need.",
        "Sanguine. Faces a false prophecy with grand equanimity.",
        "Compulsively competitive. Always needs to win.",
        "Hurt and withdrawn. Refuses to engage but needs to face an urgent task.",
        "Stressed. Torn by responsibilities, will snap soon.",
        "Languid. Naturally relaxed and unstressed.",
        "Secretly deep. Surprising insights hide behind simple words.",
        "Terribly repressed. Hides all personal desires behind a wall of politeness.",
        "Suspicious and accusing. Projects own fears and crimes onto others.",
        "Tired and ready to snap. Hates everyone almost as much as themselves.",
        "Violent. Uses aggression to mask inner loneliness.",
        "Lonely and shy. Terrified of opening up.",
        "Scarred and angry. Confused about how to break the cycle of pain.",
        "Delusional. Refuses to accept that anything might be going wrong.",
        "Paranoid. Convinced lings are out to get them.",
        "Persecuted. Chased by vile creatures out of space and time (L2, flabby).",
        "Funny alcoholic in denial about their problems.",
        "Blubbering and ineffectual. Secretly vicious and disgustingly cruel.",
        "Cruel and callous. Only out for themselves.",
        "Manipulative and dangerous. Convinced they are a chosen leader.",
        "Passionate and loud. They are bringing a better world.",
        "Vengeful. Consumed by hate after witnessing horrible crimes.",
        "Curious. Driven to discover what soil their roots spring from.",
        "Prone to intellectualizing. Refuses to engage with problems; instead they",
        "enumerate all the techniques that could be used as a solution.",
        "Humorous and devoted. They laugh against the coming of the Great Tentacled Unity.",
        "Snide and hypochondriac. Convinced they will die soon (but won’t).",
        "Megalomaniacal. Full of grand schemes for the Tower of Ultimate Power.",
        "Bumbling visionary. Clumsy but capable of greatness.",
        "Merciful and capable. Seeks to help a worthy youth.",
        "Nervous. Saw a mysterious creature. Twice.",
        "Boring as a brick. Honest, good, and dull. Truly doing something good.",
        "Sarcastic, fun, and a traitor.",
        "Friendly murderhobo. Has a map to a treasure buried under an orphanage.",
        "Aggressive and upbeat. Willing to downplay any risk.",
        "Cheery but sinister. Everything they say seems to have a dark side.",
        "Incredibly knowledgeable but inhumane. Fortunately very passive.",
        "Roguish and lovable. Also incredibly callous and greedy.",
        "Silly voice and walk but skilled in battle. Carries a worthless secret.",
        "Jarring and gruff. Loyal and deeply wrong about a nearby faction.",
        "Committed to a local faction, unswerving in their devotion.",
        "Cold and logical, skilled in unarmed combat, driven by odd impulses.",
        "Methodical and grim, scarred by a thousand battles, now loyal to a distant lord.",
        "Angry. So angry. Beaten down, seemingly accursed. Has a nemesis (L2d6, fate).",
        "Grinning and charming, can’t seem to do wrong. Even though they do.",
        "Sly and obsequious, but genuinely believes they are helping the world.",
        "Deranged. Certain they are an alien trapped in a mortal shell. Perhaps they are?",
        "Hasty to judge. Bearer of a contagious curse.",
        "Stunningly charismatic but oblivious to their charm. Followed by a cortège. Pliable?",
        "Drug addict and secret heir to a blood-soaked fortune (€1d10* x 20,000).",
        "Young and inexperienced but the focus of a grand prophecy.",
        "Thunderous and domineering. They were wronged once, never again.",
        "Incomprehensible and strange. A hero from a far off land?",
        "Rebellious, callous, and harsh. Also, devoted to a good cause.",
        "Taunting and jokey. Secretly a dark magician.",
        "Uncouth and loud. Very loud. Also, very caring and devoted, looking for a master,",
        "in fact. See, they had a master. A great master. Very hush hush.",
        "Ornery as a mule and about as wise. They are the key to a cult.",
        "Afraid of the dark and convinced the hills have eyes. They actually do.",
        "Zany beyond belief. Also, completely wrong about monsters.",
        "Kleptomaniac. Also, cursed to degenerate into a vicious beast (L1d8, hopping).",
        "Querulous and nostalgic. Miss the old days and might help bring them back.",
        "Randy and devious in a friendly way. Offended the wrong people.",
        "Jokey but sad inside. Cursed to never die by a distant machine deity."
      ]
    },
    "color": {
      "type": "one-roll string table",
      "interface": "!1d100",
      "values": [
        "Rage",
        "Vigilance",
        "Loathing",
        "Grief",
        "Amazement",
        "Terror",
        "Admiration",
        "Joy",
        "Decline",
        "Fall",
        "Aggression",
        "Contempt",
        "Remorse",
        "Disapproval",
        "Awe",
        "Submission",
        "Love",
        "Optimism",
        "Hope",
        "Despair",
        "Grandparent",
        "Parent",
        "Uncle",
        "Aunt",
        "Cousin",
        "Sibling",
        "Child",
        "Nephew",
        "Niece",
        "Grandchild",
        "Adoption",
        "Oath",
        "Blood Union",
        "Spirit",
        "Growth",
        "Modification",
        "Rewriting",
        "Change",
        "Rivalry",
        "Bravado",
        "Professional",
        "Amorous",
        "Status",
        "Wealth",
        "Parental",
        "Sibling",
        "Friendly",
        "Unholy",
        "Consumption",
        "Destruction",
        "Adultery",
        "Theft",
        "Deceit",
        "Murder",
        "Betrayal",
        "Seduction",
        "Captivity",
        "Torture",
        "Assistance",
        "Protection",
        "Fear",
        "Boredom",
        "Trust",
        "Distraction",
        "Anger",
        "Interest",
        "Serenity",
        "Annoyance",
        "Regret",
        "Acceptance",
        "Childhood",
        "Friendship",
        "Schooling",
        "Military",
        "Apprenticeship",
        "Traveling",
        "Hobby",
        "Work",
        "Tribulation",
        "Fate",
        "Betrothal",
        "Marriage",
        "Bereavement",
        "Death",
        "Remembrance",
        "Curiosity",
        "Laziness",
        "Determination",
        "Domination",
        "Enthrallment",
        "Disenchantment",
        "Investigation",
        "Science",
        "Meaninglessness",
        "Void",
        "Madness",
        "Meditation",
        "Peace",
        "Enlightenment",
        "Transcendence"
      ]
    }
  }
}